# Вопросы и ответы викторины с категориями
questions = [
    ("Ваш идеальный день начинается с...", {
        "Прогулки на свежем воздухе": "А",
        "Медитации или чтения": "Б",
        "Активной тренировки": "В",
        "Встречи с друзьями": "Г"
    }),

    ("Какая стихия вам ближе всего?", {
        "Огонь": "А",
        "Вода": "Б",
        "Земля": "В",
        "Воздух": "Г"
    }),

    ("Ваше отношение к риску...", {
        "Люблю испытывать судьбу": "А",
        "Осторожно взвешиваю все ЗА и ПРОТИВ": "Б",
        "Избегаю рисков, где это возможно": "В",
        "Риск - это возможность для роста": "Г"
    }),

    ("Выберите ваше любимое время суток?", {
        "Утро": "А",
        "День": "Б",
        "Вечер": "В",
        "Ночь": "Г"
    }),

    ("Как вы относитесь к одиночеству?", {
        "Ценю возможность побыть одному": "А",
        "Иногда нуждаюсь в одиночестве, но не часто": "Б",
        "Стараюсь избегать": "В",
        "Не люблю быть одиноким": "Г"
    }),

    ("Какой из этих элементов вам наиболее интересен?", {
        "Книги": "А",
        "Огонь": "Б",
        "Вода": "В",
        "Камни": "Г"
    }),

    ("Ваше отношение к изменениям...", {
        "Всегда открыт новым идеям": "А",
        "Аккуратно адаптируюсь к изменениям": "Б",
        "Скептически отношусь к новому": "В",
        "Изменения пугают меня": "Г"
    }),

    ("Какой ландшафт вам по душе?", {
        "Горы": "А",
        "Лес": "Б",
        "Пустыня": "В",
        "Океан": "Г"
    }),

    ("Что для вас важнее всего?", {
        "Семья": "А",
        "Карьера": "Б",
        "Творчество": "В",
        "Приключения": "Г"
    }),

    ("Как вы обычно решаете проблемы?", {
        "Интуитивно": "А",
        "Логически": "Б",
        "Советуюсь с друзьями": "В",
        "Избегаю конфронтации": "Г"
    }),
]